MikroElektronika/core_packages/RX/gcc/def/renesas/R5F572MDHDBD/mcu.h
typedef struct st_exdmac1 {
	void          *EDMSAR;
	void          *EDMDAR;
	unsigned long  EDMCRA;
	unsigned short EDMCRB;
	char           wk0[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short DCTG : 2;
			unsigned short  : 6;
			unsigned short SZ : 2;
			unsigned short  : 2;
			unsigned short DTS : 2;
			unsigned short MD : 2;
#else
			unsigned short MD : 2;
			unsigned short DTS : 2;
			unsigned short  : 2;
			unsigned short SZ : 2;
			unsigned short  : 6;
			unsigned short DCTG : 2;
#endif
	} BIT;
	} EDMTMD;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DACKSEL : 1;
			unsigned char DACKW : 1;
			unsigned char DACKE : 1;
			unsigned char DACKS : 1;
			unsigned char  : 4;
#else
			unsigned char  : 4;
			unsigned char DACKS : 1;
			unsigned char DACKE : 1;
			unsigned char DACKW : 1;
			unsigned char DACKSEL : 1;
#endif
	} BIT;
	} EDMOMD;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DARIE : 1;
			unsigned char SARIE : 1;
			unsigned char RPTIE : 1;
			unsigned char ESIE : 1;
			unsigned char DTIE : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char DTIE : 1;
			unsigned char ESIE : 1;
			unsigned char RPTIE : 1;
			unsigned char SARIE : 1;
			unsigned char DARIE : 1;
#endif
	} BIT;
	} EDMINT;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long DARA : 5;
			unsigned long  : 1;
			unsigned long DM : 2;
			unsigned long SARA : 5;
			unsigned long  : 1;
			unsigned long SM : 2;
			unsigned long DIR : 1;
			unsigned long AMS : 1;
			unsigned long  : 14;
#else
			unsigned long  : 14;
			unsigned long AMS : 1;
			unsigned long DIR : 1;
			unsigned long SM : 2;
			unsigned long  : 1;
			unsigned long SARA : 5;
			unsigned long DM : 2;
			unsigned long  : 1;
			unsigned long DARA : 5;
#endif
	} BIT;
	} EDMAMD;
	char           wk1[4];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DTE : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char DTE : 1;
#endif
	} BIT;
	} EDMCNT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SWREQ : 1;
			unsigned char  : 3;
			unsigned char CLRS : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char CLRS : 1;
			unsigned char  : 3;
			unsigned char SWREQ : 1;
#endif
	} BIT;
	} EDMREQ;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ESIF : 1;
			unsigned char  : 3;
			unsigned char DTIF : 1;
			unsigned char  : 2;
			unsigned char ACT : 1;
#else
			unsigned char ACT : 1;
			unsigned char  : 2;
			unsigned char DTIF : 1;
			unsigned char  : 3;
			unsigned char ESIF : 1;
#endif
	} BIT;
	} EDMSTS;
	char           wk2[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DREQS : 2;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char DREQS : 2;
#endif
	} BIT;
	} EDMRMD;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char EREQ : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char EREQ : 1;
#endif
	} BIT;
	} EDMERF;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PREQ : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char PREQ : 1;
#endif
	} BIT;
	} EDMPRF;
} st_exdmac1_t;

typedef struct st_flash {
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short ROMCEN : 1;
			unsigned short  : 15;
#else
			unsigned short  : 15;
			unsigned short ROMCEN : 1;
#endif
	} BIT;
	} ROMCE;
	char           wk0[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short ROMCIV : 1;
			unsigned short  : 15;
#else
			unsigned short  : 15;
			unsigned short ROMCIV : 1;
#endif
	} BIT;
	} ROMCIV;
	char           wk1[58];
	unsigned long  NCRG0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 1;
			unsigned long NC1E : 1;
			unsigned long NC2E : 1;
			unsigned long NC3E : 1;
			unsigned long NCSZ : 17;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long NCSZ : 17;
			unsigned long NC3E : 1;
			unsigned long NC2E : 1;
			unsigned long NC1E : 1;
			unsigned long  : 1;
#endif
	} BIT;
	} NCRC0;
	unsigned long  NCRG1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 1;
			unsigned long NC1E : 1;
			unsigned long NC2E : 1;
			unsigned long NC3E : 1;
			unsigned long NCSZ : 17;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long NCSZ : 17;
			unsigned long NC3E : 1;
			unsigned long NC2E : 1;
			unsigned long NC1E : 1;
			unsigned long  : 1;
#endif
	} BIT;
	} NCRC1;
	char           wk2[45638];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FLWE : 2;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char FLWE : 2;
#endif
	} BIT;
	} FWEPROR;
	char           wk3[7798185];
	unsigned char  EEPFCLK;
	char           wk4[8143];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 3;
			unsigned char DFAE : 1;
			unsigned char CMDLK : 1;
			unsigned char  : 2;
			unsigned char CFAE : 1;
#else
			unsigned char CFAE : 1;
			unsigned char  : 2;
			unsigned char CMDLK : 1;
			unsigned char DFAE : 1;
			unsigned char  : 3;
#endif
	} BIT;
	} FASTAT;
	char           wk5[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 3;
			unsigned char DFAEIE : 1;
			unsigned char CMDLKIE : 1;
			unsigned char  : 2;
			unsigned char CFAEIE : 1;
#else
			unsigned char CFAEIE : 1;
			unsigned char  : 2;
			unsigned char CMDLKIE : 1;
			unsigned char DFAEIE : 1;
			unsigned char  : 3;
#endif
	} BIT;
	} FAEINT;
	char           wk6[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FRDYIE : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char FRDYIE : 1;
#endif
	} BIT;
	} FRDYIE;
	char           wk7[23];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long FSADDR : 32;
#else
			unsigned long FSADDR : 32;
#endif
	} BIT;
	} FSADDR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long FEADDR : 32;
#else
			unsigned long FEADDR : 32;
#endif
	} BIT;
	} FEADDR;
	char           wk8[72];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 6;
			unsigned long FLWEERR : 1;
			unsigned long  : 1;
			unsigned long PRGSPD : 1;
			unsigned long ERSSPD : 1;
			unsigned long DBFULL : 1;
			unsigned long SUSRDY : 1;
			unsigned long PRGERR : 1;
			unsigned long ERSERR : 1;
			unsigned long ILGLERR : 1;
			unsigned long FRDY : 1;
			unsigned long  : 4;
			unsigned long OTERR : 1;
			unsigned long SECERR : 1;
			unsigned long FESETERR : 1;
			unsigned long ILGCOMERR : 1;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long ILGCOMERR : 1;
			unsigned long FESETERR : 1;
			unsigned long SECERR : 1;
			unsigned long OTERR : 1;
			unsigned long  : 4;
			unsigned long FRDY : 1;
			unsigned long ILGLERR : 1;
			unsigned long ERSERR : 1;
			unsigned long PRGERR : 1;
			unsigned long SUSRDY : 1;
			unsigned long DBFULL : 1;
			unsigned long ERSSPD : 1;
			unsigned long PRGSPD : 1;
			unsigned long  : 1;
			unsigned long FLWEERR : 1;
			unsigned long  : 6;
#endif
	} BIT;
	} FSTATR;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short FENTRYC : 1;
			unsigned short  : 6;
			unsigned short FENTRYD : 1;
			unsigned short KEY : 8;
#else
			unsigned short KEY : 8;
			unsigned short FENTRYD : 1;
			unsigned short  : 6;
			unsigned short FENTRYC : 1;
#endif
	} BIT;
	} FENTRYR;
	char           wk9[6];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short SUINIT : 1;
			unsigned short  : 7;
			unsigned short KEY : 8;
#else
			unsigned short KEY : 8;
			unsigned short  : 7;
			unsigned short SUINIT : 1;
#endif
	} BIT;
	} FSUINITR;
	char           wk10[18];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short PCMDR : 8;
			unsigned short CMDR : 8;
#else
			unsigned short CMDR : 8;
			unsigned short PCMDR : 8;
#endif
	} BIT;
	} FCMDR;
	char           wk11[46];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char BCDIR : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char BCDIR : 1;
#endif
	} BIT;
	} FBCCNT;
	char           wk12[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char BCST : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char BCST : 1;
#endif
	} BIT;
	} FBCSTAT;
	char           wk13[3];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PSADR : 17;
			unsigned long  : 15;
#else
			unsigned long  : 15;
			unsigned long PSADR : 17;
#endif
	} BIT;
	} FPSADDR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long FAWS : 12;
			unsigned long  : 3;
			unsigned long FSPR : 1;
			unsigned long FAWE : 12;
			unsigned long  : 3;
			unsigned long BTFLG : 1;
#else
			unsigned long BTFLG : 1;
			unsigned long  : 3;
			unsigned long FAWE : 12;
			unsigned long FSPR : 1;
			unsigned long  : 3;
			unsigned long FAWS : 12;
#endif
	} BIT;
	} FAWMON;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short ESUSPMD : 1;
			unsigned short  : 15;
#else
			unsigned short  : 15;
			unsigned short ESUSPMD : 1;
#endif
	} BIT;
	} FCPSR;
	char           wk14[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short PCKA : 8;
			unsigned short KEY : 8;
#else
			unsigned short KEY : 8;
			unsigned short PCKA : 8;
#endif
	} BIT;
	} FPCKAR;
	char           wk15[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short SAS : 2;
			unsigned short  : 6;
			unsigned short KEY : 8;
#else
			unsigned short KEY : 8;
			unsigned short  : 6;
			unsigned short SAS : 2;
#endif
	} BIT;
	} FSUACR;
} st_flash_t;

typedef struct st_glcdc {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long B : 8;
			unsigned long G : 8;
			unsigned long R : 8;
			unsigned long A : 8;
#else
			unsigned long A : 8;
			unsigned long R : 8;
			unsigned long G : 8;
			unsigned long B : 8;
#endif
	} BIT;
	} GR1CLUT0[256];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long B : 8;
			unsigned long G : 8;
			unsigned long R : 8;
			unsigned long A : 8;
#else
			unsigned long A : 8;
			unsigned long R : 8;
			unsigned long G : 8;
			unsigned long B : 8;
#endif
	} BIT;
	} GR1CLUT1[256];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long B : 8;
			unsigned long G : 8;
			unsigned long R : 8;
			unsigned long A : 8;
#else
			unsigned long A : 8;
			unsigned long R : 8;
			unsigned long G : 8;
			unsigned long B : 8;
#endif
	} BIT;
	} GR2CLUT0[256];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long B : 8;
			unsigned long G : 8;
			unsigned long R : 8;
			unsigned long A : 8;
#else
			unsigned long A : 8;
			unsigned long R : 8;
			unsigned long G : 8;
			unsigned long B : 8;
#endif
	} BIT;
	} GR2CLUT1[256];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EN : 1;
			unsigned long  : 7;
			unsigned long VEN : 1;
			unsigned long  : 7;
			unsigned long SWRST : 1;
			unsigned long  : 15;
#else
			unsigned long  : 15;
			unsigned long SWRST : 1;
			unsigned long  : 7;
			unsigned long VEN : 1;
			unsigned long  : 7;
			unsigned long EN : 1;
#endif
	} BIT;
	} BGEN;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long FH : 11;
			unsigned long  : 5;
			unsigned long FV : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long FV : 11;
			unsigned long  : 5;
			unsigned long FH : 11;
#endif
	} BIT;
	} BGPERI;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long HP : 4;
			unsigned long  : 12;
			unsigned long VP : 4;
			unsigned long  : 12;
#else
			unsigned long  : 12;
			unsigned long VP : 4;
			unsigned long  : 12;
			unsigned long HP : 4;
#endif
	} BIT;
	} BGSYNC;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long VW : 11;
			unsigned long  : 5;
			unsigned long VP : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long VP : 11;
			unsigned long  : 5;
			unsigned long VW : 11;
#endif
	} BIT;
	} BGVSIZE;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long HW : 11;
			unsigned long  : 5;
			unsigned long HP : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long HP : 11;
			unsigned long  : 5;
			unsigned long HW : 11;
#endif
	} BIT;
	} BGHSIZE;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long B : 8;
			unsigned long G : 8;
			unsigned long R : 8;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long R : 8;
			unsigned long G : 8;
			unsigned long B : 8;
#endif
	} BIT;
	} BGCOLOR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EN : 1;
			unsigned long  : 7;
			unsigned long VEN : 1;
			unsigned long  : 7;
			unsigned long SWRST : 1;
			unsigned long  : 15;
#else
			unsigned long  : 15;
			unsigned long SWRST : 1;
			unsigned long  : 7;
			unsigned long VEN : 1;
			unsigned long  : 7;
			unsigned long EN : 1;
#endif
	} BIT;
	} BGMON;
	char           wk0[228];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long VEN : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long VEN : 1;
#endif
	} BIT;
	} GR1VEN;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RENB : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long RENB : 1;
#endif
	} BIT;
	} GR1FLMRD;
	char           wk1[4];
	unsigned long  GR1FLM2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 16;
			unsigned long LNOFF : 16;
#else
			unsigned long LNOFF : 16;
			unsigned long  : 16;
#endif
	} BIT;
	} GR1FLM3;
	char           wk2[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long DATANUM : 16;
			unsigned long LNNUM : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long LNNUM : 11;
			unsigned long DATANUM : 16;
#endif
	} BIT;
	} GR1FLM5;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 28;
			unsigned long FORMAT : 3;
			unsigned long  : 1;
#else
			unsigned long  : 1;
			unsigned long FORMAT : 3;
			unsigned long  : 28;
#endif
	} BIT;
	} GR1FLM6;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long DISPSEL : 2;
			unsigned long  : 2;
			unsigned long GRCDISPON : 1;
			unsigned long  : 3;
			unsigned long ARCDISPON : 1;
			unsigned long  : 3;
			unsigned long ARCON : 1;
			unsigned long  : 19;
#else
			unsigned long  : 19;
			unsigned long ARCON : 1;
			unsigned long  : 3;
			unsigned long ARCDISPON : 1;
			unsigned long  : 3;
			unsigned long GRCDISPON : 1;
			unsigned long  : 2;
			unsigned long DISPSEL : 2;
#endif
	} BIT;
	} GR1AB1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GRCVW : 11;
			unsigned long  : 5;
			unsigned long GRCVS : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GRCVS : 11;
			unsigned long  : 5;
			unsigned long GRCVW : 11;
#endif
	} BIT;
	} GR1AB2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GRCHW : 11;
			unsigned long  : 5;
			unsigned long GRCHS : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GRCHS : 11;
			unsigned long  : 5;
			unsigned long GRCHW : 11;
#endif
	} BIT;
	} GR1AB3;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ARCVW : 11;
			unsigned long  : 5;
			unsigned long ARCVS : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long ARCVS : 11;
			unsigned long  : 5;
			unsigned long ARCVW : 11;
#endif
	} BIT;
	} GR1AB4;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ARCHW : 11;
			unsigned long  : 5;
			unsigned long ARCHS : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long ARCHS : 11;
			unsigned long  : 5;
			unsigned long ARCHW : 11;
#endif
	} BIT;
	} GR1AB5;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ARCRATE : 8;
			unsigned long  : 8;
			unsigned long ARCCOEF : 9;
			unsigned long  : 7;
#else
			unsigned long  : 7;
			unsigned long ARCCOEF : 9;
			unsigned long  : 8;
			unsigned long ARCRATE : 8;
#endif
	} BIT;
	} GR1AB6;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CKON : 1;
			unsigned long  : 15;
			unsigned long ARCDEF : 8;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long ARCDEF : 8;
			unsigned long  : 15;
			unsigned long CKON : 1;
#endif
	} BIT;
	} GR1AB7;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CKKR : 8;
			unsigned long CKKB : 8;
			unsigned long CKKG : 8;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long CKKG : 8;
			unsigned long CKKB : 8;
			unsigned long CKKR : 8;
#endif
	} BIT;
	} GR1AB8;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CKR : 8;
			unsigned long CKB : 8;
			unsigned long CKG : 8;
			unsigned long CKA : 8;
#else
			unsigned long CKA : 8;
			unsigned long CKG : 8;
			unsigned long CKB : 8;
			unsigned long CKR : 8;
#endif
	} BIT;
	} GR1AB9;
	char           wk3[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long R : 8;
			unsigned long B : 8;
			unsigned long G : 8;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long G : 8;
			unsigned long B : 8;
			unsigned long R : 8;
#endif
	} BIT;
	} GR1BASE;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long LINE : 11;
			unsigned long  : 5;
			unsigned long SEL : 1;
			unsigned long  : 15;
#else
			unsigned long  : 15;
			unsigned long SEL : 1;
			unsigned long  : 5;
			unsigned long LINE : 11;
#endif
	} BIT;
	} GR1CLUTINT;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ARCST : 1;
			unsigned long  : 15;
			unsigned long UFST : 1;
			unsigned long  : 15;
#else
			unsigned long  : 15;
			unsigned long UFST : 1;
			unsigned long  : 15;
			unsigned long ARCST : 1;
#endif
	} BIT;
	} GR1MON;
	char           wk4[168];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long VEN : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long VEN : 1;
#endif
	} BIT;
	} GR2VEN;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RENB : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long RENB : 1;
#endif
	} BIT;
	} GR2FLMRD;
	char           wk5[4];
	unsigned long  GR2FLM2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 16;
			unsigned long LNOFF : 16;
#else
			unsigned long LNOFF : 16;
			unsigned long  : 16;
#endif
	} BIT;
	} GR2FLM3;
	char           wk6[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long DATANUM : 16;
			unsigned long LNNUM : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long LNNUM : 11;
			unsigned long DATANUM : 16;
#endif
	} BIT;
	} GR2FLM5;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 28;
			unsigned long FORMAT : 3;
			unsigned long  : 1;
#else
			unsigned long  : 1;
			unsigned long FORMAT : 3;
			unsigned long  : 28;
#endif
	} BIT;
	} GR2FLM6;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long DISPSEL : 2;
			unsigned long  : 2;
			unsigned long GRCDISPON : 1;
			unsigned long  : 3;
			unsigned long ARCDISPON : 1;
			unsigned long  : 3;
			unsigned long ARCON : 1;
			unsigned long  : 19;
#else
			unsigned long  : 19;
			unsigned long ARCON : 1;
			unsigned long  : 3;
			unsigned long ARCDISPON : 1;
			unsigned long  : 3;
			unsigned long GRCDISPON : 1;
			unsigned long  : 2;
			unsigned long DISPSEL : 2;
#endif
	} BIT;
	} GR2AB1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GRCVW : 11;
			unsigned long  : 5;
			unsigned long GRCVS : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GRCVS : 11;
			unsigned long  : 5;
			unsigned long GRCVW : 11;
#endif
	} BIT;
	} GR2AB2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GRCHW : 11;
			unsigned long  : 5;
			unsigned long GRCHS : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GRCHS : 11;
			unsigned long  : 5;
			unsigned long GRCHW : 11;
#endif
	} BIT;
	} GR2AB3;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ARCVW : 11;
			unsigned long  : 5;
			unsigned long ARCVS : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long ARCVS : 11;
			unsigned long  : 5;
			unsigned long ARCVW : 11;
#endif
	} BIT;
	} GR2AB4;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ARCHW : 11;
			unsigned long  : 5;
			unsigned long ARCHS : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long ARCHS : 11;
			unsigned long  : 5;
			unsigned long ARCHW : 11;
#endif
	} BIT;
	} GR2AB5;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ARCRATE : 8;
			unsigned long  : 8;
			unsigned long ARCCOEF : 9;
			unsigned long  : 7;
#else
			unsigned long  : 7;
			unsigned long ARCCOEF : 9;
			unsigned long  : 8;
			unsigned long ARCRATE : 8;
#endif
	} BIT;
	} GR2AB6;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CKON : 1;
			unsigned long  : 15;
			unsigned long ARCDEF : 8;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long ARCDEF : 8;
			unsigned long  : 15;
			unsigned long CKON : 1;
#endif
	} BIT;
	} GR2AB7;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CKKR : 8;
			unsigned long CKKB : 8;
			unsigned long CKKG : 8;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long CKKG : 8;
			unsigned long CKKB : 8;
			unsigned long CKKR : 8;
#endif
	} BIT;
	} GR2AB8;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CKR : 8;
			unsigned long CKB : 8;
			unsigned long CKG : 8;
			unsigned long CKA : 8;
#else
			unsigned long CKA : 8;
			unsigned long CKG : 8;
			unsigned long CKB : 8;
			unsigned long CKR : 8;
#endif
	} BIT;
	} GR2AB9;
	char           wk7[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long R : 8;
			unsigned long B : 8;
			unsigned long G : 8;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long G : 8;
			unsigned long B : 8;
			unsigned long R : 8;
#endif
	} BIT;
	} GR2BASE;
	union {
		unsigned long LONG;
		struct {
			
